In [12]:
import pandas as pd
import numpy as np

In [13]:
#Data Cleaning
#1. Find missing data ->Drop record, fill value [Complex if value is important, need to then recover the data]
#2. Find Invalid Values eg, float col with str -> [Complex if dealing with domain, like age being 200, need to ]
#3. 
#4.

In [14]:
pd.isnull(np.nan)

True

In [15]:
pd.isnull(None)

True

In [16]:
pd.isna(np.nan)

True

In [17]:
pd.isna(None)

True

In [18]:
pd.notnull(np.nan)

False

In [19]:
pd.notnull(None)

False

In [20]:
pd.notna(np.nan)

False

In [22]:
#Work in series and DF
pd.isnull(pd.Series([1,np.nan,7]))

0    False
1     True
2    False
dtype: bool

In [31]:
pd.notnull(pd.Series([1,np.nan,7]))

0     True
1    False
2     True
dtype: bool

In [32]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

In [24]:
#Operations with missing values
#nan not 'virus', operations will ignore them
#Hack to apply
pd.Series([1,2,np.nan]).count()

2

In [27]:
pd.Series([1,2,np.nan]).sum()

3.0

In [28]:
pd.Series([1,2,np.nan]).mean()

1.5

In [33]:
#Filtering Missing Data
s = pd.Series([1,2,3,np.nan,np.nan,4])

In [34]:
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [35]:
pd.isnull(s)

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [36]:
pd.notnull(s).sum()

4

In [37]:
pd.isnull(s).sum()

2

In [38]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [39]:
#Dropping Null Values
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [40]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

In [42]:
#Dropping null values on DF
df = pd.DataFrame({

    [1,2,3,np.nan],
    [5,np.nan,np.nan,8],
    [np.nan,10,11,12]
})

In [43]:
df

     0     1     2     3
0  1.0   2.0   3.0   NaN
1  5.0   NaN   NaN   8.0
2  NaN  10.0  11.0  12.0

In [44]:
df.shape

(3, 4)

In [45]:
df.info

<bound method DataFrame.info of      0     1     2     3
0  1.0   2.0   3.0   NaN
1  5.0   NaN   NaN   8.0
2  NaN  10.0  11.0  12.0>

In [46]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       2 non-null      float64
 1   1       2 non-null      float64
 2   2       2 non-null      float64
 3   3       2 non-null      float64
dtypes: float64(4)
memory usage: 224.0 bytes

In [47]:
df.isnull()

       0      1      2      3
0  False  False  False   True
1  False   True   True  False
2   True  False  False  False

In [49]:
df.isnull().count()

0    3
1    3
2    3
3    3
dtype: int64

In [50]:
df.isnull().sum()

0    1
1    1
2    1
3    1
dtype: int64

In [51]:
df.dropna()

Empty DataFrame
Columns: [0, 1, 2, 3]
Index: []

In [52]:
df

     0     1     2     3
0  1.0   2.0   3.0   NaN
1  5.0   NaN   NaN   8.0
2  NaN  10.0  11.0  12.0

In [53]:
df.dropna(axis = 1)

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [54]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

In [59]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [58]:
df2.dropna(how = 'all')

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [61]:
df2.dropna(how='any')

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [63]:
#thresh- min nuber of non-null values to be kept
df2.dropna(thresh=3, axis = 'columns')

Empty DataFrame
Columns: []
Index: [0, 1, 2]

In [64]:
#fillinf Null 

s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [65]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [67]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [68]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [69]:
#Fill nulls with close(contiguous) values
#Forward Fill
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [70]:
#Backward Fikk
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

In [71]:
#What about values on extremes of Ser/DF
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [72]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

In [73]:
#Filling Null values on DF
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110],
})

In [74]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [78]:
df.shape

(4, 4)

In [76]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [79]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [81]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

In [82]:
#Default dropna drops all rows with any null
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [84]:
df.dropna(axis = 'columns')

   Column D
0         5
1         8
2        34
3       110

In [85]:
#Too extreme to drop all rows with any null values, control this will 'how
df.dropna(how = 'all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [86]:
df.dropna(how = 'any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [97]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100]
})

In [98]:
df2.dropna(how = 'all')#Drops for when any row or ocl has all null values

   Column A  Column B  Column C
0       1.0       2.0       NaN
2      30.0      31.0     100.0

In [100]:
df2.dropna(how = 'any')

   Column A  Column B  Column C
2      30.0      31.0     100.0

In [101]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [102]:
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [103]:
df.dropna(thresh = 3)
#min number of non-null values for row/col to be kept

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [104]:
df.dropna(thresh=3,axis='columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

In [105]:
#Filling null values
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [106]:
df.fillna({
    'Column A':0,
    'Column B': 99,
    'Column C': df['Column C'].mean()
})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [107]:
df.fillna(method='ffill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [108]:
df.fillna(method='ffill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

In [109]:
#check missing values
#if there are, s.dropna() will have less elements than s
s.dropna().count()

4

In [112]:
missing = len(s.dropna()) != len(s)
missing

True

In [113]:
#Also count, excludes nan from result
len(s)

6

In [114]:
s.count()

4

In [115]:
#So we can say
missing = s.count() != len(s)
missing

True

In [116]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [117]:
# A more Python approach
pd.Series([True, False, False]).any()

True

In [118]:
pd.Series([True, False, False]).all()

False

In [119]:
pd.Series([True, True, True]).all()

True

In [120]:
#.all() or .any() check if all, or any values are True
#isnull method returns boolean with True where there is nan
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [123]:
#So, can yse any method with boolean arry

pd.Series([1,np.nan]).isnull().any()

True

In [124]:
pd.Series([1,2]).isnull().any()

False

In [126]:
#More strict way is to check values of series
s.isnull().values

array([False, False, False,  True,  True, False])

In [127]:
s.isnull().values.any()

True